master/cases/sydney/ic.fine/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "1750";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (3 0 0);

boundaryField
{
    nozzle
    {
		type            timeVaryingMappedFixedValue;
		setAverage      off;
    }
    coflow
	{
		type            fixedValue;
		value      	uniform (3.0 0 0);
	}
    walls
    {
        type            zeroGradient;
    }
    front
    {
        type            wedge;
    }
    back
    {
		type			wedge;
	}
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
